Revit 2026 API

# PrintManagerPaperSources Property

---

Get all print sources of current printer.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PaperSourceSet PaperSources { get; }
```
```vb
Public ReadOnly Property PaperSources As PaperSourceSet
	Get
```
```cpp
public:
property PaperSourceSet^ PaperSources {
	PaperSourceSet^ get ();
}
```
```fsharp
member PaperSources : PaperSourceSet with get
```

#### Property Value

PaperSourceSet

These are the valid paper source for the current printer.

#### Reference

PrintManager Class

Autodesk.Revit.DB Namespace